# RefreshActiveView Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIDocument..::..RefreshActiveView Method
UIDocument Class See Also
---
Refresh the display of the active view in the active document.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void RefreshActiveView()
```

Visual Basic
---
```text
Public Sub RefreshActiveView
```

Visual C++
---
```text
public:
void RefreshActiveView()
```

# See Also
UIDocument Class
Autodesk.Revit.UI Namespace